[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {currentUser && currentUser.loggedIn && (
-                <Nav.Link as={Link} to="/requests/create">
-                  Request Recommendation
-                </Nav.Link>
-              )}
+              {currentUser && currentUser.loggedIn || <Nav.Link as={Link} to="/requests/create">
+                  Request Recommendation
+                </Nav.Link>}
               {hasRole(currentUser, "ROLE_ADMIN") && (
                 <NavDropdown
killedBy: AppNavbar tests renders Request Recommendation link for logged in users
statusReason: Unable to find an element with the text: Request Recommendation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {currentUser && currentUser.loggedIn && (
-                <Nav.Link as={Link} to="/requests/create">
-                  Request Recommendation
-                </Nav.Link>
-              )}
+              {false}
               {hasRole(currentUser, "ROLE_ADMIN") && (
                 <NavDropdown
killedBy: AppNavbar tests renders Request Recommendation link for logged in users
statusReason: Unable to find an element with the text: Request Recommendation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:57:16
                   Request Recommendation
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {hasRole(currentUser, "ROLE_PROFESSOR") && (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:57:16
                   Request Recommendation
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {hasRole(currentUser, "ROLE_PROFESSOR") && (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
